In [2]:
import numpy as np 
import pandas as pd

In [3]:
df = pd.DataFrame(data = np.arange(0,20))

In [4]:
df.head()

   0
0  0
1  1
2  2
3  3
4  4

In [5]:
df.shape

(20, 1)

In [6]:
type(df)

pandas.core.frame.DataFrame

In [7]:
df = pd.DataFrame(data = np.arange(0,20).reshape(4,5))

In [7]:
df

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [8]:
df = pd.DataFrame(data = np.arange(0,20).reshape(4,5), columns = ['col1','col2','col3','col4','col5'], index=['row1','row2','row3','row4'])

In [10]:
df

      col1  col2  col3  col4  col5
row1     0     1     2     3     4
row2     5     6     7     8     9
row3    10    11    12    13    14
row4    15    16    17    18    19

In [11]:
df.head()

      col1  col2  col3  col4  col5
row1     0     1     2     3     4
row2     5     6     7     8     9
row3    10    11    12    13    14
row4    15    16    17    18    19

In [19]:
df.transpose().values @ df.values

array([[350, 380, 410, 440, 470],
       [380, 414, 448, 482, 516],
       [410, 448, 486, 524, 562],
       [440, 482, 524, 566, 608],
       [470, 516, 562, 608, 654]])

In [20]:
df

      col1  col2  col3  col4  col5
row1     0     1     2     3     4
row2     5     6     7     8     9
row3    10    11    12    13    14
row4    15    16    17    18    19

In [22]:
df.unstack()

col1  row1     0
      row2     5
      row3    10
      row4    15
col2  row1     1
      row2     6
      row3    11
      row4    16
col3  row1     2
      row2     7
      row3    12
      row4    17
col4  row1     3
      row2     8
      row3    13
      row4    18
col5  row1     4
      row2     9
      row3    14
      row4    19
dtype: int32

In [23]:
df.stack()

row1  col1     0
      col2     1
      col3     2
      col4     3
      col5     4
row2  col1     5
      col2     6
      col3     7
      col4     8
      col5     9
row3  col1    10
      col2    11
      col3    12
      col4    13
      col5    14
row4  col1    15
      col2    16
      col3    17
      col4    18
      col5    19
dtype: int32

In [24]:
df

      col1  col2  col3  col4  col5
row1     0     1     2     3     4
row2     5     6     7     8     9
row3    10    11    12    13    14
row4    15    16    17    18    19

In [25]:
df.columns

Index(['col1', 'col2', 'col3', 'col4', 'col5'], dtype='object')

In [26]:
df.index

Index(['row1', 'row2', 'row3', 'row4'], dtype='object')

In [27]:
df.col1.value_counts()

0     1
10    1
5     1
15    1
Name: col1, dtype: int64

In [28]:
df.col1.unique()

array([ 0,  5, 10, 15])

In [29]:
df.col1.truncate()

row1     0
row2     5
row3    10
row4    15
Name: col1, dtype: int32

In [30]:
df

      col1  col2  col3  col4  col5
row1     0     1     2     3     4
row2     5     6     7     8     9
row3    10    11    12    13    14
row4    15    16    17    18    19

In [32]:
help(df.truncate)

Help on method truncate in module pandas.core.generic:

truncate(before=None, after=None, axis=None, copy: 'bool_t' = True) -> 'FrameOrSeries' method of pandas.core.frame.DataFrame instance
    Truncate a Series or DataFrame before and after some index value.

    This is a useful shorthand for boolean indexing based on index
    values above or below certain thresholds.

    Parameters
    ----------
    before : date, str, int
        Truncate all rows before this index value.
    after : date, str, int
        Truncate all rows after this index value.
    axis : {0 or 'index', 1 or 'columns'}, optional
        Axis to truncate. Truncates the index (rows) by default.
    copy : bool, default is True,
        Return a copy of the truncated section.

    Returns
    -------
    type of caller
        The truncated Series or DataFrame.

    See Also
    --------
    DataFrame.loc : Select a subset of a DataFrame by label.
    DataFrame.iloc : Select a subset of a DataFrame by position.

    Notes
    -----
    If the index being truncated contains only datetime values,
    `before` and `after` may be specified as strings instead of
    Timestamps.

    Examples
    --------
    >>> df = pd.DataFrame({'A': ['a', 'b', 'c', 'd', 'e'],
    ...                    'B': ['f', 'g', 'h', 'i', 'j'],
    ...                    'C': ['k', 'l', 'm', 'n', 'o']},
    ...                   index=[1, 2, 3, 4, 5])
    >>> df
       A  B  C
    1  a  f  k
    2  b  g  l
    3  c  h  m
    4  d  i  n
    5  e  j  o

    >>> df.truncate(before=2, after=4)
       A  B  C
    2  b  g  l
    3  c  h  m
    4  d  i  n

    The columns of a DataFrame can be truncated.

    >>> df.truncate(before="A", after="B", axis="columns")
       A  B
    1  a  f
    2  b  g
    3  c  h
    4  d  i
    5  e  j

    For Series, only rows can be truncated.

    >>> df['A'].truncate(before=2, after=4)
    2    b
    3    c
    4    d
    Name: A, dtype: object

    The index values in ``truncate`` can be datetimes or string
    dates.

    >>> dates = pd.date_range('2016-01-01', '2016-02-01', freq='s')
    >>> df = pd.DataFrame(index=dates, data={'A': 1})
    >>> df.tail()
                         A
    2016-01-31 23:59:56  1
    2016-01-31 23:59:57  1
    2016-01-31 23:59:58  1
    2016-01-31 23:59:59  1
    2016-02-01 00:00:00  1

    >>> df.truncate(before=pd.Timestamp('2016-01-05'),
    ...             after=pd.Timestamp('2016-01-10')).tail()
                         A
    2016-01-09 23:59:56  1
    2016-01-09 23:59:57  1
    2016-01-09 23:59:58  1
    2016-01-09 23:59:59  1
    2016-01-10 00:00:00  1

    Because the index is a DatetimeIndex containing only dates, we can
    specify `before` and `after` as strings. They will be coerced to
    Timestamps before truncation.

    >>> df.truncate('2016-01-05', '2016-01-10').tail()
                         A
    2016-01-09 23:59:56  1
    2016-01-09 23:59:57  1
    2016-01-09 23:59:58  1
    2016-01-09 23:59:59  1
    2016-01-10 00:00:00  1

    Note that ``truncate`` assumes a 0 value for any unspecified time
    component (midnight). This differs from partial string slicing, which
    returns any partially matching dates.

    >>> df.loc['2016-01-05':'2016-01-10', :].tail()
                         A
    2016-01-10 23:59:55  1
    2016-01-10 23:59:56  1
    2016-01-10 23:59:57  1
    2016-01-10 23:59:58  1
    2016-01-10 23:59:59  1

In [33]:
df.isnull()

       col1   col2   col3   col4   col5
row1  False  False  False  False  False
row2  False  False  False  False  False
row3  False  False  False  False  False
row4  False  False  False  False  False

In [34]:
df.isnull().any()

col1    False
col2    False
col3    False
col4    False
col5    False
dtype: bool

In [35]:
df.isnull().sum()

col1    0
col2    0
col3    0
col4    0
col5    0
dtype: int64

In [36]:
df.isnull().sum().sum()

0

In [37]:
df.isnull().values.any()

False

In [38]:
df[['col1','col2']]

      col1  col2
row1     0     1
row2     5     6
row3    10    11
row4    15    16

In [39]:
df.col1.value_counts()

0     1
10    1
5     1
15    1
Name: col1, dtype: int64

In [41]:
df.col1.sort_values()

row1     0
row2     5
row3    10
row4    15
Name: col1, dtype: int32

In [42]:
from io import StringIO, BytesIO

In [43]:
dt = (
    'col1,col2,col3\n'
    '1,2,3\n'
    '4,5,6\n'
    '7,8,9\n'
)

In [44]:
StringIO(dt)

In [45]:
data = pd.read_csv(StringIO(dt))

In [46]:
data

   col1  col2  col3
0     1     2     3
1     4     5     6
2     7     8     9

In [47]:
data.describe()

       col1  col2  col3
count   3.0   3.0   3.0
mean    4.0   5.0   6.0
std     3.0   3.0   3.0
min     1.0   2.0   3.0
25%     2.5   3.5   4.5
50%     4.0   5.0   6.0
75%     5.5   6.5   7.5
max     7.0   8.0   9.0

In [50]:
data.dtypes

col1    int64
col2    int64
col3    int64
dtype: object

In [52]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    3 non-null      int64
 1   col2    3 non-null      int64
 2   col3    3 non-null      int64
dtypes: int64(3)
memory usage: 200.0 bytes